import math

print("Теория вероятностей и математическая статистика")
print("Семинар 4. Непрерывная случайная величина")
print("Задание 3:\n\
Непрерывная случайная величина X распределена нормально и задана плотностью распределения\n\
f(x) = (1 / (4 * sqrt(2pi))) * exp((-(x+2)**2) / 32)\n\
Найдите:\n\
а) M(X)\n\
б) D(X)\n\
в) std(X) (среднее квадратичное отклонение)")

# из формулы
a=-2
σ=4

print(f"Решение 3:\n\
а) M(X)={a}\n\
б) D(X)={σ**2}\n\
в) std(X)={σ} (среднее квадратичное отклонение)")
