'''
Три друга взяли вещи в поход. Сформируйте словарь, где ключ - имя друга, а значение - кортеж вещей.
Ответьте на вопросы:
1. Какие вещи взяли все три друга
2. Какие вещи уникальны, есть только у одного друга
3. Какие вещи есть у всех друзей кроме одного, и имя того, у кого данная вещ отсутствует
4. Для решения используйте опреайии с множествами. Код должен расшираться на любое большее количество друзей
'''

goodies = {'friend1':('b','c','d'),
           'friend2':('a','c','d'),
           'friend3':('a','b','d')
           }

print(f'{goodies = }')
